README.org
*Prairie Hill Learning Center*

NAV => [[Dev]] / [[Styles]] / [[Index]] / [[Template]] / [[Dashboard]]

* Config

  #+NAME: package.json
  #+begin_src js :tangle package.json :padline no
    {
      "name": "phill-angular2",
      "version": "1.0.0",
      "scripts": {
        "start": "tsc && concurrently \"npm run tsc:w\" \"npm run lite\" ",
        "lite": "lite-server",
        "postinstall": "typings install",
        "tsc": "tsc",
        "tsc:w": "tsc -w",
        "typings": "typings"
      },
      "license": "ISC",
      "dependencies": {
        "@angular/common":  "2.0.0-rc.1",
        "@angular/compiler":  "2.0.0-rc.1",
        "@angular/core":  "2.0.0-rc.1",
        "@angular/http":  "2.0.0-rc.1",
        "@angular/platform-browser":  "2.0.0-rc.1",
        "@angular/platform-browser-dynamic":  "2.0.0-rc.1",
        "@angular/router":  "2.0.0-rc.1",
        "@angular/router-deprecated":  "2.0.0-rc.1",
        "@angular/upgrade":  "2.0.0-rc.1",
        "systemjs": "0.19.27",
        "core-js": "^2.4.0",
        "reflect-metadata": "^0.1.3",
        "rxjs": "5.0.0-beta.6",
        "zone.js": "^0.6.12",
        "angular2-in-memory-web-api": "0.0.10",
        "bootstrap": "^3.3.6"
      },
      "devDependencies": {
        "concurrently": "^2.0.0",
        "lite-server": "^2.2.0",
        "typescript": "^1.8.10",
        "typings":"^0.8.1"
      }
    }
  #+end_src

  #+NAME: tsconfig.json
  #+begin_src js :tangle tsconfig.json :padline no
    {
      "compilerOptions": {
        "target": "es5",
        "module": "commonjs",
        "moduleResolution": "node",
        "sourceMap": true,
        "emitDecoratorMetadata": true,
        "experimentalDecorators": true,
        "removeComments": false,
        "noImplicitAny": false
      },
      "exclude": [
        "node_modules",
        "typings/main",
        "typings/main.d.ts"
      ]
    }
  #+end_src

  #+NAME: typings.json
  #+begin_src js :tangle typings.json :padline no
    {
      "ambientDependencies": {
        "core-js": "registry:dt/core-js#0.0.0+20160317120654",
        "jasmine": "registry:dt/jasmine#2.2.0+20160412134438",
        "node": "registry:dt/node#4.0.0+20160509154515"
      }
    }
  #+end_src

  #+NAME: systemjs.config.js
  #+begin_src js :tangle systemjs.config.js :padline no
    /**
     ,* System configuration for Angular 2 samples
     ,* Adjust as necessary for your application needs.
     ,*/
    (function(global) {
      // map tells the System loader where to look for things
      var map = {
        'app':                        'app', // 'dist',
        '@angular':                   'node_modules/@angular',
        'angular2-in-memory-web-api': 'node_modules/angular2-in-memory-web-api',
        'rxjs':                       'node_modules/rxjs'
      };
      // packages tells the System loader how to load when no filename and/or no extension
      var packages = {
        'app':                        { main: 'main.js',  defaultExtension: 'js' },
        'rxjs':                       { defaultExtension: 'js' },
        'angular2-in-memory-web-api': { main: 'index.js', defaultExtension: 'js' }
      };
      var ngPackageNames = [
        'common',
        'compiler',
        'core',
        'http',
        'platform-browser',
        'platform-browser-dynamic',
        'router',
        'router-deprecated',
        'upgrade',
      ];
      // Add package entries for angular packages
      ngPackageNames.forEach(function(pkgName) {
        packages['@angular/'+pkgName] = { main: pkgName + '.umd.js', defaultExtension: 'js' };
      });
      var config = {
        map: map,
        packages: packages
      }
      System.config(config);
    })(this);
  #+end_src

* App

  NAV => [[Index]] / [[Dev]] / [[Styles]] / [[Template]] / [[Dashboard]]

  #+NAME: main.ts
  #+begin_src js :tangle app/main.ts :padline no
    // TEMP: Imports for loading & configuring the in-memory web api
    import { provide } from '@angular/core';
    import { XHRBackend } from '@angular/http';

    import { InMemoryBackendService, SEED_DATA } from 'angular2-in-memory-web-api';
    import { InMemoryDataService } from './in-memory-data.service';

    import { bootstrap }    from '@angular/platform-browser-dynamic';
    import { HTTP_PROVIDERS } from '@angular/http';

    import { AppComponent } from './app.component';

    bootstrap(AppComponent, [
        HTTP_PROVIDERS,
        provide(XHRBackend, {
            useClass: InMemoryBackendService }), // in-mem server
        provide(SEED_DATA, {
            useClass: InMemoryDataService }) // in-mem server data
    ]);
  #+end_src

  #+NAME: app.component.ts
  #+begin_src js :tangle app/app.component.ts :padline no
    import { Component } from '@angular/core';
    import { RouteConfig, ROUTER_DIRECTIVES, ROUTER_PROVIDERS } from '@angular/router-deprecated';

    import { DashboardComponent } from './dashboard.component';
    import { PagesComponent } from './pages.component';
    import { PageDetailComponent } from './page-detail.component';
    import { PageService } from './page.service';

    @Component({
        selector: 'my-app',

        template: `
            <h1>{{title}}</h1>
            <nav>
              <a [routerLink]="['Dashboard']">Dashboard</a>
              <a [routerLink]="['Pages']">Pages</a>
            </nav>
            <router-outlet></router-outlet>
            `,
        styleUrls: ['app/app.component.css'],
        directives: [ROUTER_DIRECTIVES],
        providers: [
            ROUTER_PROVIDERS,
            PageService
        ]
    })

    @RouteConfig([
        {
            path: '/dashboard',
            name: 'Dashboard',
            component: DashboardComponent,
            useAsDefault: true
        },
        {
            path: '/detail/:id',
            name: 'PageDetail',
            component: PageDetailComponent
        },
        {
            path: '/pages',
            name: 'Pages',
            component: PagesComponent
        }
    ])

    export class AppComponent {
        title = 'Prairie Hill Learning Center';
    }
  #+end_src

  #+NAME: in-memory-data.service.ts
  #+begin_src js :tangle app/in-memory-data.service.ts :padline no
    export class InMemoryDataService {
      createDb() {
        let pages = [
         { "id": 1,  "title": "Home"       },
         { "id": 2,  "title": "About"      },
         { "id": 3,  "title": "Programs"   },
         { "id": 4,  "title": "Tours"      },
         { "id": 5,  "title": "Staff"      },
         { "id": 6,  "title": "Calendar"   },
         { "id": 7,  "title": "Employment" },
         { "id": 8,  "title": "Donate"     },
         { "id": 9,  "title": "Contact"    },
         { "id": 10, "title": "Events"     }
        ];
        return {pages};
      }
    }
  #+end_src

** Dashboard

   NAV => [[app.component.ts]] / [[dashboard.component.html]] / [[page-detail.component.css]]
   => [[app.component.css]] / [[dashboard.component.css]] 

   #+NAME: dashboard.component.ts
   #+begin_src js :tangle app/dashboard.component.ts :padline no
     import { Component, OnInit } from '@angular/core';

     import { Page } from './page';
     import { PageService } from './page.service';

     import { Router } from '@angular/router-deprecated';

     @Component({
         selector: 'my-dashboard',
         templateUrl: 'app/dashboard.component.html',
         styleUrls: ['app/dashboard.component.css']
     })

     export class DashboardComponent implements OnInit {

         pages: Page[] = [];

         constructor(
             private router: Router,
             private pageService: PageService) {
         }

         ngOnInit() {
             this.pageService.getPages()
                 .then(pages => this.pages = pages.slice(1,5));
         }

         gotoDetail(page: Page){
             let link = ['PageDetail', { id: page.id }];
             this.router.navigate(link);
         }
     }
   #+end_src

