README.org
** Pages

   #+NAME: NAV
   TEMP => [[dashboard.component.html]] / [[page-detail.component.html]] / [[pages.component.html]]
   SERV => [[page.service.ts]] 
   COMP => [[page-detail.component.ts]] / [[pages.component.ts]] / [[dashboard.component.ts]]
   STYL => [[pages.component.css]] /

   #+NAME: page.ts
   #+begin_src js :tangle app/page.ts :padline no
     export class Page {
         id: number;
         title: string;
     }
   #+end_src

   #+NAME: pages.component.ts
   #+begin_src js :tangle app/pages.component.ts :padline no
     import { Component, OnInit } from '@angular/core';
     import { Router } from '@angular/router-deprecated';

     import { Page } from './page';
     import { PageService } from './page.service';
     import { PageDetailComponent } from './page-detail.component';

     @Component({
         selector: 'my-pages',
         templateUrl: 'app/pages.component.html',
         styleUrls: ['app/pages.component.css'],
         directives: [PageDetailComponent]
     })

     export class PagesComponent implements OnInit {
         pages: Page[]; 
         selectedPage: Page;
         addingPage = false;
         error: any;

         constructor(
             private _router: Router,
             private _pageService: PageService) { }

         getPages() {
             this._pageService
                 .getPages()
                 .then(pages => this.pages = pages)
                 .catch(error => this.error = error); //TODO: Display error message
         }

         addPage() {
             this.addingPage = true;
             this.selectedPage = null;
         }

         close(savedPage: Page) {
             this.addingPage = false;
             if (savedPage) { this.getPages(); }
         }

         delete(page: Page, event: any) {
             event.stopPropagation();
             this._pageService
                 .delete(page)
                 .then(res => {
                     this.pages = this.pages.filter(h => h !== page);
                     if (this.selectedPage === page) {
                         this.selectedPage = null; }
                 })
                 .catch(error => this.error = error); // TODO: Display error message
         }

         ngOnInit() {
             this.getPages();
         }
         
         onSelect(page: Page) {
             this.selectedPage = page;
             this.addingPage = false;
         }

         gotoDetail() {
             this._router.navigate(['PageDetail', {
                 id: this.selectedPage.id }]);
         }
     }
   #+end_src

   #+NAME: page-detail.component.ts
   #+begin_src js :tangle app/page-detail.component.ts :padline no
     import { Component, Input, Output, OnInit, EventEmitter } from '@angular/core';
     import { RouteParams } from '@angular/router-deprecated';

     import { Page } from './page';
     import { PageService } from './page.service';

     @Component({
         selector: 'my-page-detail',
         templateUrl: 'app/page-detail.component.html',
         styleUrls: ['app/page-detail.component.css']
     })

     export class PageDetailComponent implements OnInit {
         @Input() page: Page;
         @Output() close = new EventEmitter();
         error: any;
         navigated = false; // true if navigated here

         constructor(
             private _pageService: PageService,
             private _routeParams: RouteParams) {
         }
         
         ngOnInit() {
             if (this._routeParams.get('id') !== null) {
                 let id = +this._routeParams.get('id');
                 this.navigated = true;
                 this._pageService.getPage(id)
                     .then(page => this.page = page);
             } else {
                 this.navigated = false;
                 this.page = new Page();
             }
         }

         save() {
             this._pageService
                 .save(this.page)
                 .then(page => {
                     this.page = page; // saved page, w/ id if new
                     this.goBack(page);
                 })
                 .catch(error => this.error = error); // TODO: Display error message
         }
         
         goBack(savedPage: Page = null) {
             this.close.emit(savedPage);
             if (this.navigated) {
                 window.history.back();
             }
         }
     }
   #+end_src

   #+NAME: page.service.ts
   #+begin_src js :tangle app/page.service.ts :padline no
     import { Injectable } from '@angular/core';
     import { Http, Headers } from '@angular/http';

     import 'rxjs/add/operator/toPromise';

     import { Page } from './page';

     @Injectable()
     export class PageService {

         private pagesUrl = 'app/pages'; // URL to web api

         constructor(private http: Http) { }
         
         // CREATE new Page
         private post(page: Page): Promise<Page> {
             let headers = new Headers({
                 'Content-Type': 'application/json'});

             return this.http
                 .post(this.pagesUrl,
                       JSON.stringify(page),
                       {headers: headers})
                 .toPromise()
                 .then(res => res.json().data)
                 .catch(this.handleError);
         }

         // READ existing Page(s)
         getPages(): Promise<Page[]> {
             return this.http.get(this.pagesUrl)
                 .toPromise()
                 .then(response => response.json().data)
                 .catch(this.handleError);
         }
         getPage(id: number) {
             return this.getPages()
                 .then(pages => pages.filter(page => page.id === id)[0]);
         }
         
         // UPDATE existing Page
         private put(page: Page) {
             let headers = new Headers();
             headers.append('Content-Type',
                            'application/json');

             let url = `${this.pagesUrl}/${page.id}`;

             return this.http
                 .put(url, JSON.stringify(page),
                      {headers: headers})
                 .toPromise()
                 .then(() => page)
                 .catch(this.handleError);
         }

         // DESTROY existing Page
         delete(page: Page) {
             let headers = new Headers();
             headers.append('Content-Type',
                            'application/json');

             let url = `${this.pagesUrl}/${page.id}`;

             return this.http
                 .delete(url, headers)
                 .toPromise()
                 .catch(this.handleError);
         }

         // SAVE combination of _post and _put methods
         save(page: Page): Promise<Page> {
             if (page.id) {
                 return this.put(page);
             }
             return this.post(page);
         }
         
         // handle ERRORS
         private handleError(error: any) {
             console.error('An error occurred', error);
             return Promise.reject(error.message || error);
         }
     }
   #+end_src

