README.org
* Template

  APP  => [[App]] /
  SERV => [[page.service.ts]] /
  COMP => [[page-detail.component.ts]] / [[pages.component.ts]]
  TEMP => [[page-detail.component.html]]

  #+NAME: index.html
  #+begin_src web :tangle index.html :padline no
    <html>
      <head>
        <base href="/">
        
        <title>Prairie Hill Learning Center</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <!--<link rel="stylesheet" href="css/pure-release-0.6.0/pure-min.css">-->
        <link rel="stylesheet" href="styles.css">
        <link href='//fonts.googleapis.com/css?family=Lobster|Roboto:400,100,100italic,700italic,700|Clicker+Script|Kaushan+Script|News+Cycle:400,700|BenchNine|Poiret+One|Open+Sans+Condensed:300|Playball|Shadows+Into+Light+Two' rel='stylesheet' type='text/css'>

        <!-- 1. Load libraries -->
         <!-- Polyfill(s) for older browsers -->
        <script src="node_modules/core-js/client/shim.min.js"></script>
        <script src="node_modules/zone.js/dist/zone.js"></script>
        <script src="node_modules/reflect-metadata/Reflect.js"></script>
        <script src="node_modules/systemjs/dist/system.src.js"></script>

        <!--<script src="https://www.gstatic.com/firebasejs/3.0.0/firebase.js"></script>-->
        
        <!-- 2. Configure SystemJS -->
        <script src="systemjs.config.js"></script>
        <script>
         System.import('app').catch(function(err){ console.error(err); });
        </script>
      </head>
      <!-- 3. Display the application -->
      <body>
        <div id="header" styleName="pure-g">
          <phill-header>...</phill-header>
        </div>
        <div id="main" styleName="pure-g">
          <my-app>Loading...</my-app>
        </div>
        <div id="footer" styleName="pure-g">
          <phill-footer>...</phill-footer>
        </div>
      </body>
    </html>
  #+end_src

** Dashboard

   NAV => [[dashboard.component.ts]] / [[pages.component.ts]] /

   #+NAME: dashboard.component.html
   #+begin_src web :tangle app/dashboard.component.html :padline no
     <h3>Prairie Hill Pages (Spaces)</h3>
     <div class="grid grid-pad">
       <div *ngFor="let page of pages"
            (click)="gotoDetail(page)" class="col-1-4">
         <div class="module page">
           <h4>{{page.title}}</h4>
         </div>
       </div>
     </div>
   #+end_src

** Pages

   #+NAME: pages.component.html
   #+begin_src web :tangle app/pages.component.html :padline no
     <h2>My Pages</h2>
     <ul class="pages">
       <li *ngFor="let page of pages"
           (click)="onSelect(page)"
           [class.selected]="page === selectedPage">
         <span class="page-element">
           <span class="badge">{{page.id}}</span> {{page.title}}
         </span>
         <button class="delete-button"
                 (click)="delete(page, $event)">Delete</button>
       </li>
     </ul>

     <button (click)="addPage()">Add New Page</button>
     <div *ngIf="addingPage">
       <my-page-detail (close)="close($event)"></my-page-detail>
     </div>

     <div *ngIf="selectedPage">
       <h2>
         {{selectedPage.title | uppercase}} is your current page
       </h2>
       <button (click)="gotoDetail()">View Details</button>
     </div>
   #+end_src

   #+NAME: page-detail.component.html
   #+begin_src web :tangle app/page-detail.component.html :padline no
     <div *ngIf="page">
       <h2>{{page.title}}</h2>
       <div>
         <label>id: </label>{{page.id}}
       </div>
       <div>
         <label>title: </label>
         <input [(ngModel)]="page.title" placeholder="title"/>
       </div>
       <button (click)="goBack()">Back</button>
       <button (click)="save()">Save</button>
     </div>
   #+end_src

* Styles

  [[Dev]] / [[App]]

  #+NAME: styles.css
  #+begin_src css :tangle styles.css :padline no
    h1 {
      color: #369;
      font-family: Arial, Helvetica, sans-serif;
      font-size: 250%;
    }
    h2 { 
      color: #444;
      font-family: Arial, Helvetica, sans-serif;   
      font-weight: lighter;
    }
    body { 
      margin: 2em; 
    }
    body, input[text], button { 
      color: #888; 
      font-family: Cambria, Georgia; 
    }
    button {
      font-family: Arial;
      background-color: #eee;
      border: none;
      padding: 5px 10px;
      border-radius: 4px;
      cursor: pointer;
      cursor: hand;
    }
    button:hover {
      background-color: #cfd8dc;
    }
    button:disabled {
      background-color: #eee;
      color: #aaa; 
      cursor: auto;
    }
    /* everywhere else */
    ,* { 
      font-family: Arial, Helvetica, sans-serif; 
    }
  #+end_src

  NAV => [[index.html]] / [[pages.component.html]] / [[pages.component.ts]]

  #+NAME: app.component.css
  #+begin_src css :tangle app/app.component.css :padline no
    h1 {
      font-size: 1.2em;
      color: #999;
      margin-bottom: 0;
    }
    h2 {
      font-size: 2em;
      margin-top: 0;
      padding-top: 0;
    }
    nav a {
      padding: 5px 10px;
      text-decoration: none;
      margin-top: 10px;
      display: inline-block;
      background-color: #eee;
      border-radius: 4px;
    }
    nav a:visited, a:link {
      color: #607D8B;
    }
    nav a:hover {
      color: #039be5;
      background-color: #CFD8DC;
    }
    nav a.router-link-active {
      color: #039be5;
    }
  #+end_src
  
** Dashboard

   #+NAME: dashboard.component.css
   #+begin_src css :tangle app/dashboard.component.css :padline no
     [class*='col-'] {
       float: left;
     }
     ,*, *:after, *:before {
         -webkit-box-sizing: border-box;
         -moz-box-sizing: border-box;
         box-sizing: border-box;
     }
     h3 {
       text-align: center; margin-bottom: 0;
     }
     [class*='col-'] {
       padding-right: 20px;
       padding-bottom: 20px;
     }
     [class*='col-']:last-of-type {
       padding-right: 0;
     }
     .grid {
       margin: 0;
     }
     .col-1-4 {
       width: 25%;
     }
     .module {
         padding: 20px;
         text-align: center;
         color: #eee;
         max-height: 120px;
         min-width: 120px;
         background-color: #607D8B;
         border-radius: 2px;
     }
     h4 {
       position: relative;
     }
     .module:hover {
       background-color: #EEE;
       cursor: pointer;
       color: #607d8b;
     }
     .grid-pad {
       padding: 10px 0;
     }
     .grid-pad > [class*='col-']:last-of-type {
       padding-right: 20px;
     }
     @media (max-width: 600px) {
         .module {
           font-size: 10px;
           max-height: 75px; }
     }
     @media (max-width: 1024px) {
         .grid {
           margin: 0;
         }
         .module {
           min-width: 60px;
         }
     }
   #+end_src

