README.org
** Pages

   #+NAME: pages.component.css
   #+begin_src css :tangle app/pages.component.css
     .selected {
         background-color: #CFD8DC !important;
         color: white;
     }
     .pages {
         margin: 0 0 2em 0;
         list-style-type: none;
         padding: 0;
         width: 15em;
     }
     .pages li {
         cursor: pointer;
         position: relative;
         left: 0;
         background-color: #EEE;
         margin: .5em;
         padding: .3em 0;
         height: 1.6em;
         border-radius: 4px;
     }
     .pages li.selected:hover {
         background-color: #BBD8DC !important;
         color: white;
     }
     .pages li:hover {
         color: #607D8B;
         background-color: #DDD;
         left: .1em;
     }
     .pages .text {
         position: relative;
         top: -3px;
     }
     .pages .badge {
         display: inline-block;
         font-size: small;
         color: white;
         padding: 0.8em 0.7em 0 0.7em;
         background-color: #607D8B;
         line-height: 1em;
         position: relative;
         left: -1px;
         top: -4px;
         height: 1.8em;
         margin-right: .8em;
         border-radius: 4px 0 0 4px;
     }

   #+end_src

   #+NAME: page-detail.component.css
   #+begin_src css :tangle app/page-detail.component.css
     label {
       display: inline-block;
       width: 3em;
       margin: .5em 0;
       color: #607D8B;
       font-weight: bold;
     }
     input {
       height: 2em;
       font-size: 1em;
       padding-left: .4em;
     }
     button {
       margin-top: 20px;
       font-family: Arial;
       background-color: #eee;
       border: none;
       padding: 5px 10px;
       border-radius: 4px;
       cursor: pointer; cursor: hand;
     }
     button:hover {
       background-color: #cfd8dc;
     }
     button:disabled {
       background-color: #eee;
       color: #ccc; 
       cursor: auto;
     }
   #+end_src

* Dev

** Sun May 22 14:10:19 CDT 2016

   https://angular.io/docs/ts/latest/tutorial/toh-pt5.html

   Routing

   - [ ] turn [[App]] into an application shell that only handles navigation
   - [ ] relocate /Pages/ concerns within the current [[app.component.js]] to a separate
     [[PagesComponent]]
   - [ ] add routing
   - [ ] create a new [[DashboardComponent]]
   - [ ] tie the /Dashboard/ into the navigation structure
  
** Sat May 21 22:28:33 CDT 2016

   https://angular.io/docs/js/latest/quickstart.html

  Angular2 is written with TypeScript(ES6). This is the future.
  
  https://angular.io/docs/ts/latest/quickstart.html

  1. Create the app's project folder and define package dependencies and special
     project setup

     a) Create the project folder

        You are in [[./][it]].

     b) Add package definitiion and configuration files

        [[Config]]

        [[package.json]]
        [[tsconfig.json]]
        [[typings.json]]
        [[systemjs.config.js]]

     c) Install packages

        : npm install

        - [-] npm WARN
          - [X] optional
            
            : Skipping failed optional dependency /chokidar/fsevents:

            https://github.com/paulmillr/chokidar/issues/425

            "It's just a warning, not an error. You can safely ignore it. 
            Fsevents is an optional dependency and is used on only on OSX."
            --nono

          - [X] notsup

            : Not compatible with your operating system or architecture: fsevents@1.0.12

          - [ ] phill-angular2@1.0.0 No repository field.

  2. Create the app's Angular root component
     ---------------------------------------

     [[Config]] / [[App]]
     -------------
     app/[[app.component.ts]]

     Structure of every component:
     -----------------------------

     - One or more [[import]] statments to reference the things we need.
     - A [[@Component decorator]] that tells Angular what template to use and how to
       create the component.
     - A [[component class]] that controls the appearance and behavior of a view 
       through its template.
     
  3. Add [[main.ts]], identifying the root component to Angular

     [[App]]

     app/[[main.ts]]

  4. Add [[index.html]], the web page that hosts the application

     [[Template]]

  5. Build and run the app

     : npm start

** Tutorials

   https://angular.io/docs/ts/latest/tutorial/toh-pt3.html

   [[app.component.ts]]

   [[page-detail.component.ts]]
  
   [[App]]
