README.md

## Pages<a id="sec-4-2" name="sec-4-2"></a>

    .selected {
        background-color: #CFD8DC !important;
        color: white;
    }
    .pages {
        margin: 0 0 2em 0;
        list-style-type: none;
        padding: 0;
        width: 15em;
    }
    .pages li {
        cursor: pointer;
        position: relative;
        left: 0;
        background-color: #EEE;
        margin: .5em;
        padding: .3em 0;
        height: 1.6em;
        border-radius: 4px;
    }
    .pages li.selected:hover {
        background-color: #BBD8DC !important;
        color: white;
    }
    .pages li:hover {
        color: #607D8B;
        background-color: #DDD;
        left: .1em;
    }
    .pages .text {
        position: relative;
        top: -3px;
    }
    .pages .badge {
        display: inline-block;
        font-size: small;
        color: white;
        padding: 0.8em 0.7em 0 0.7em;
        background-color: #607D8B;
        line-height: 1em;
        position: relative;
        left: -1px;
        top: -4px;
        height: 1.8em;
        margin-right: .8em;
        border-radius: 4px 0 0 4px;
    }

    label {
      display: inline-block;
      width: 3em;
      margin: .5em 0;
      color: #607D8B;
      font-weight: bold;
    }
    input {
      height: 2em;
      font-size: 1em;
      padding-left: .4em;
    }
    button {
      margin-top: 20px;
      font-family: Arial;
      background-color: #eee;
      border: none;
      padding: 5px 10px;
      border-radius: 4px;
      cursor: pointer; cursor: hand;
    }
    button:hover {
      background-color: #cfd8dc;
    }
    button:disabled {
      background-color: #eee;
      color: #ccc; 
      cursor: auto;
    }

# Dev<a id="sec-5" name="sec-5"></a>

## Sun May 22 14:10:19 CDT 2016<a id="sec-5-1" name="sec-5-1"></a>

<https://angular.io/docs/ts/latest/tutorial/toh-pt5.html>

Routing

-   [ ] turn 2 into an application shell that only handles navigation
-   [ ] relocate *Pages* concerns within the current to a separate
-   [ ] add routing
-   [ ] create a new
-   [ ] tie the *Dashboard* into the navigation structure

## Sat May 21 22:28:33 CDT 2016<a id="sec-5-2" name="sec-5-2"></a>

<https://angular.io/docs/js/latest/quickstart.html>

Angular2 is written with TypeScript(ES6). This is the future.

<https://angular.io/docs/ts/latest/quickstart.html>

1.  Create the app's project folder and define package dependencies and special
    project setup
    1.  Create the project folder
        
        You are in [it](./).
    
    2.  Add package definitiion and configuration files
        
        1
        
        1
        2
        3
        4
    
    3.  Install packages
        
            npm install
        
        -   [-] npm WARN
            -   [X] optional
                
                    Skipping failed optional dependency /chokidar/fsevents:
                
                <https://github.com/paulmillr/chokidar/issues/425>
                
                "It's just a warning, not an error. You can safely ignore it. 
                Fsevents is an optional dependency and is used on only on OSX."
                &#x2013;nono
            
            -   [X] notsup
                
                    Not compatible with your operating system or architecture: fsevents@1.0.12
            
            -   [ ] phill-angular2@1.0.0 No repository field.

2.  Create the app's Angular root component
    
    ---
    
    1 / 2
    
    ---
    
    app/6
    
    Structure of every component:
    
    ---
    
    -   One or more statments to reference the things we need.
    -   A that tells Angular what template to use and how to
        create the component.
    -   A that controls the appearance and behavior of a view 
        through its template.

3.  Add 5, identifying the root component to Angular
    
    2
    
    app/5

4.  Add 13, the web page that hosts the application
    
    3

5.  Build and run the app
    
        npm start

## Tutorials<a id="sec-5-3" name="sec-5-3"></a>

<https://angular.io/docs/ts/latest/tutorial/toh-pt3.html>

6

11

2
